#+TITLE: TensorFlow Tutorial #21

*** Imports
#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
  %matplotlib inline
  import matplotlib.pyplot as plt
  import tensorflow as tf
  import numpy as np
  import math
  import os
#+END_SRC

#+RESULTS:
:RESULTS:
2 - b0022cea-5dd7-4749-8baf-5592f2fcb55a
:END:

/home/magnus/anaconda3/envs/tf-gpu/lib/python3.6/site-packages/h5py/__init__.py:36:
FutureWarning: Conversion of the second argument of issubdtype from `float` to
`np.floating` is deprecated. In future, it will be treated as `np.float64 ==
np.dtype(float).type`.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
from ._conv import register_converters as _register_converters
#+END_SRC

#+RESULTS:
:RESULTS:
0 - 486ce335-b7a8-4092-a3c5-a6cbba398854
:END:

We need to import several things from Keras.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
# from tf.keras.models import Model  # This does not work!
from tensorflow.python.keras.models import Model
from tensorflow.python.keras.layers import Input, Dense, GRU, Embedding
from tensorflow.python.keras.optimizers import RMSprop
from tensorflow.python.keras.callbacks import EarlyStopping, ModelCheckpoint, TensorBoard
from tensorflow.python.keras.preprocessing.text import Tokenizer
from tensorflow.python.keras.preprocessing.sequence import pad_sequences
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[4]:
:END:

This was developed using Python 3.6 (Anaconda) and package versions:

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
tf.__version__
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[5]:
: '1.6.0'
:END:

'1.5.0'

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
tf.keras.__version__
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[9]:
: '2.1.3-tf'
:END:

'2.1.2-tf'

*** Load Data
We will use the Europarl data-set which has sentence-pairs in most European
languages. The data was created by the European Union which translates a lot of
their communications to the languages of the member-countries of the European
Union.

http://www.statmt.org/europarl/

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
  import europarl
#+END_SRC

#+RESULTS:
:RESULTS:
0 - c4fcc074-24e9-46e7-9ea5-2e112134cc2e
:END:

In this tutorial I have used the *English-Danish* data-set which contains about
2 million sentence-pairs. You can use another language by changing this
language-code, see europarl.py for a list of available language-codes.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
language_code='da'
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[11]:
:END:

In order for the decoder to know when to begin and end a sentence, we need to
mark the start and end of each sentence with words that most likely don't occur
in the data-set.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
mark_start = 'ssss '
mark_end = ' eeee'
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[12]:
:END:

You can change the directory for the data-files if you like.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
# data_dir = "data/europarl/"
#+END_SRC
This will automatically download and extract the data-files if you don't have
them already.

WARNING: The file for the English-Danish data-set is about 587 MB!

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
europarl.maybe_download_and_extract(language_code=language_code)
#+END_SRC

Data has apparently already been downloaded and unpacked.
Load the texts for the source-language, here we use Danish.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
data_src = europarl.load_data(english=False,
                              language_code=language_code)
#+END_SRC

Load the texts for the destination-language, here we use English.

#+BEGIN_SRC ipython :tangle yes :session :exports both :async t :results raw drawer
data_dest = europarl.load_data(english=True,
                               language_code=language_code,
                               start=mark_start,
                               end=mark_end)
#+END_SRC

We will build a model to translate from the source language (Danish) to the
destination language (English). If you want to make the inverse translation you
can merely exchange the source and destination data.

